loadtest-token-post-redis-tuning-results.txt
C:/Users/xsaad/Documents/authforge/.tools/k6-v0.54.0-windows-amd64/k6.exe run loadtest/k6/token_exchange.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest/k6/token_exchange.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 55s max duration (incl. graceful stop):
              * token_exchange: 15 looping VUs for 45s (gracefulStop: 10s)


running (01.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [   2% ] 15 VUs  01.0s/45s

running (02.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [   4% ] 15 VUs  02.0s/45s

running (03.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [   7% ] 15 VUs  03.0s/45s

running (04.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [   9% ] 15 VUs  04.0s/45s

running (05.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [  11% ] 15 VUs  05.0s/45s

running (06.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [  13% ] 15 VUs  06.0s/45s

running (07.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [  16% ] 15 VUs  07.0s/45s

running (08.0s), 15/15 VUs, 0 complete and 0 interrupted iterations
token_exchange   [  18% ] 15 VUs  08.0s/45s

running (09.0s), 15/15 VUs, 7 complete and 0 interrupted iterations
token_exchange   [  20% ] 15 VUs  09.0s/45s

running (10.0s), 15/15 VUs, 15 complete and 0 interrupted iterations
token_exchange   [  22% ] 15 VUs  10.0s/45s

running (11.0s), 15/15 VUs, 15 complete and 0 interrupted iterations
token_exchange   [  24% ] 15 VUs  11.0s/45s

running (12.0s), 15/15 VUs, 15 complete and 0 interrupted iterations
token_exchange   [  27% ] 15 VUs  12.0s/45s

running (13.0s), 15/15 VUs, 18 complete and 0 interrupted iterations
token_exchange   [  29% ] 15 VUs  13.0s/45s

running (14.0s), 15/15 VUs, 19 complete and 0 interrupted iterations
token_exchange   [  31% ] 15 VUs  14.0s/45s

running (15.0s), 15/15 VUs, 20 complete and 0 interrupted iterations
token_exchange   [  33% ] 15 VUs  15.0s/45s

running (16.0s), 15/15 VUs, 26 complete and 0 interrupted iterations
token_exchange   [  36% ] 15 VUs  16.0s/45s

running (17.0s), 15/15 VUs, 26 complete and 0 interrupted iterations
token_exchange   [  38% ] 15 VUs  17.0s/45s

running (18.0s), 15/15 VUs, 28 complete and 0 interrupted iterations
token_exchange   [  40% ] 15 VUs  18.0s/45s

running (19.0s), 15/15 VUs, 31 complete and 0 interrupted iterations
token_exchange   [  42% ] 15 VUs  19.0s/45s

running (20.0s), 15/15 VUs, 34 complete and 0 interrupted iterations
token_exchange   [  44% ] 15 VUs  20.0s/45s

running (21.0s), 15/15 VUs, 37 complete and 0 interrupted iterations
token_exchange   [  47% ] 15 VUs  21.0s/45s

running (22.0s), 15/15 VUs, 41 complete and 0 interrupted iterations
token_exchange   [  49% ] 15 VUs  22.0s/45s

running (23.0s), 15/15 VUs, 43 complete and 0 interrupted iterations
token_exchange   [  51% ] 15 VUs  23.0s/45s

running (24.0s), 15/15 VUs, 45 complete and 0 interrupted iterations
token_exchange   [  53% ] 15 VUs  24.0s/45s

running (25.0s), 15/15 VUs, 52 complete and 0 interrupted iterations
token_exchange   [  56% ] 15 VUs  25.0s/45s

running (26.0s), 15/15 VUs, 52 complete and 0 interrupted iterations
token_exchange   [  58% ] 15 VUs  26.0s/45s

running (27.0s), 15/15 VUs, 54 complete and 0 interrupted iterations
token_exchange   [  60% ] 15 VUs  27.0s/45s

running (28.0s), 15/15 VUs, 54 complete and 0 interrupted iterations
token_exchange   [  62% ] 15 VUs  28.0s/45s

running (29.0s), 15/15 VUs, 62 complete and 0 interrupted iterations
token_exchange   [  64% ] 15 VUs  29.0s/45s

running (30.0s), 15/15 VUs, 66 complete and 0 interrupted iterations
token_exchange   [  67% ] 15 VUs  30.0s/45s

running (31.0s), 15/15 VUs, 66 complete and 0 interrupted iterations
token_exchange   [  69% ] 15 VUs  31.0s/45s

running (32.0s), 15/15 VUs, 66 complete and 0 interrupted iterations
token_exchange   [  71% ] 15 VUs  32.0s/45s

running (33.0s), 15/15 VUs, 70 complete and 0 interrupted iterations
token_exchange   [  73% ] 15 VUs  33.0s/45s

running (34.0s), 15/15 VUs, 74 complete and 0 interrupted iterations
token_exchange   [  76% ] 15 VUs  34.0s/45s

running (35.0s), 15/15 VUs, 75 complete and 0 interrupted iterations
token_exchange   [  78% ] 15 VUs  35.0s/45s

running (36.0s), 15/15 VUs, 77 complete and 0 interrupted iterations
token_exchange   [  80% ] 15 VUs  36.0s/45s

running (37.0s), 15/15 VUs, 78 complete and 0 interrupted iterations
token_exchange   [  82% ] 15 VUs  37.0s/45s

running (38.0s), 15/15 VUs, 82 complete and 0 interrupted iterations
token_exchange   [  84% ] 15 VUs  38.0s/45s

running (39.0s), 15/15 VUs, 84 complete and 0 interrupted iterations
token_exchange   [  87% ] 15 VUs  39.0s/45s

running (40.0s), 15/15 VUs, 87 complete and 0 interrupted iterations
token_exchange   [  89% ] 15 VUs  40.0s/45s

running (41.0s), 15/15 VUs, 88 complete and 0 interrupted iterations
token_exchange   [  91% ] 15 VUs  41.0s/45s

running (42.0s), 15/15 VUs, 89 complete and 0 interrupted iterations
token_exchange   [  93% ] 15 VUs  42.0s/45s

running (43.0s), 15/15 VUs, 90 complete and 0 interrupted iterations
token_exchange   [  96% ] 15 VUs  43.0s/45s

running (44.0s), 15/15 VUs, 93 complete and 0 interrupted iterations
token_exchange   [  98% ] 15 VUs  44.0s/45s

running (45.0s), 15/15 VUs, 97 complete and 0 interrupted iterations
token_exchange   [ 100% ] 15 VUs  45.0s/45s

running (46.0s), 14/15 VUs, 98 complete and 0 interrupted iterations
token_exchange ↓ [ 100% ] 15 VUs  45s

running (47.0s), 14/15 VUs, 98 complete and 0 interrupted iterations
token_exchange ↓ [ 100% ] 15 VUs  45s

running (48.0s), 10/15 VUs, 102 complete and 0 interrupted iterations
token_exchange ↓ [ 100% ] 15 VUs  45s

     ✗ login form
      ↳  98% — ✓ 110 / ✗ 2
     ✗ login redirect
      ↳  94% — ✓ 106 / ✗ 6
     ✗ authorization redirect
      ↳  99% — ✓ 111 / ✗ 1
     ✗ authorization code issued
      ↳  93% — ✓ 105 / ✗ 7
     ✗ token exchange 200
      ↳  93% — ✓ 105 / ✗ 7
     ✗ access token present
      ↳  93% — ✓ 105 / ✗ 7

     checks.........................: 95.53% 642 out of 672
     data_received..................: 859 kB 18 kB/s
     data_sent......................: 275 kB 5.7 kB/s
     http_req_blocked...............: avg=1.43ms   min=0s      med=0s       p(90)=0s     p(95)=0s       p(99)=53.22ms  max=54.75ms
     http_req_connecting............: avg=622.36µs min=0s      med=0s       p(90)=0s     p(95)=0s       p(99)=23.3ms   max=25.06ms
     http_req_duration..............: avg=1.28s    min=22.94ms med=677.42ms p(90)=3.75s  p(95)=4.72s    p(99)=5.67s    max=6.73s  
       { expected_response:true }...: avg=1.26s    min=22.94ms med=675ms    p(90)=3.75s  p(95)=4.59s    p(99)=5.59s    max=6.73s  
     http_req_failed................: 2.85%  16 out of 560
     http_req_receiving.............: avg=11.53ms  min=0s      med=1.83ms   p(90)=8.52ms p(95)=11.37ms  p(99)=274.59ms max=1.05s  
     http_req_sending...............: avg=75.91µs  min=0s      med=0s       p(90)=0s     p(95)=548.93µs p(99)=705.01µs max=12.51ms
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       p(90)=0s     p(95)=0s       p(99)=0s       max=0s     
     http_req_waiting...............: avg=1.27s    min=19.77ms med=668.95ms p(90)=3.75s  p(95)=4.72s    p(99)=5.67s    max=6.73s  
     http_reqs......................: 560    11.557617/s
     iteration_duration.............: avg=6.42s    min=2.44s   med=6.38s    p(90)=9.34s  p(95)=9.45s    p(99)=10.21s   max=10.3s  
     iterations.....................: 112    2.311523/s
     vus............................: 10     min=10         max=15
     vus_max........................: 15     min=15         max=15


running (48.5s), 00/15 VUs, 112 complete and 0 interrupted iterations
token_exchange ✓ [ 100% ] 15 VUs  45s